In [1]:
import pandas as pd

In [10]:
df1 = pd.read_csv('demodataset.csv')

In [11]:
df1

    Name Location   Age  Score BloodGroup  Eligible
0   Jhon       CA   NaN    9.0       B+ve       0.0
1   Mike       LA  32.0    9.0       B+ve       1.0
2   Dane       NY   NaN    8.0       A-ve       NaN
3  Peter       NY  33.0    2.0       O+ve       0.0
4  Macey      NaN   NaN    NaN       O-ve       0.0
5  Chimp       CA  53.0    4.0       A-ve       0.0
6  Jacob    TEXAS  34.0    5.0       A+ve       1.0
7   Dany       DC  21.0    1.0      AB-ve       1.0

In [14]:
#It will dispaly the record of those whose age is above 40.

df1[df1['Age'] > 40 ]

    Name Location   Age  Score BloodGroup  Eligible
5  Chimp       CA  53.0    4.0       A-ve       0.0

In [20]:
#It will dispaly the record of those whose BloodGropu is O+ve.

df1[df1['BloodGroup'] == 'O+ve']

    Name Location   Age  Score BloodGroup  Eligible
3  Peter       NY  33.0    2.0       O+ve       0.0

In [4]:
#It will dispaly the record of those whose Location is NY.
df1[df1['Location'] == 'NY']

NameError: name 'df1' is not defined

In [25]:
#Get the record whose location is CA and Age is Greater than 30.

df1[(df1['Location'] == 'CA') &  (df1['Age'] > 30)]

    Name Location   Age  Score BloodGroup  Eligible
5  Chimp       CA  53.0    4.0       A-ve       0.0

In [29]:
#Drop the record whose age is less than 40.
#index is used to identify the index number so that drop those record on the basis of index position.
#This method is only for droping rows.

df1.drop(df1[df1['Age'] < 40].index)

    Name Location   Age  Score BloodGroup  Eligible
0   Jhon       CA   NaN    9.0       B+ve       0.0
2   Dane       NY   NaN    8.0       A-ve       NaN
4  Macey      NaN   NaN    NaN       O-ve       0.0
5  Chimp       CA  53.0    4.0       A-ve       0.0

In [ ]:
#inplace = True is used to delete/make changes in original data also.

#df1.drop(df1[df1['Age'] < 40].index, inplace = True)